app/controllers/api/v1/post/post_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."authentication_token" = $1 LIMIT 1  [["authentication_token", "4fTZsiGknMH8cnHcZEy1"]]
INSERT INTO "posts" ("title", "latitude", "longitude", "description", "price", "security_deposit", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
	def create
		@user = User.find_by_authentication_token(request.headers['X-API-TOKEN'])
        if @user
        	@post = ::Post.new(post_params.merge!(user: @user))
			respond_to do |format|
				format.json {
					if @post.save

SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
---
	def index
		allPosts = ::Post.all.order(:created_at).reverse_order # gets all posts, apply filters

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 4]]
---
	def show
		begin
			onePost = ::Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 4]]
---
	def destroy
		currentUserId = current_user.id
		postId = params[:id]
		response.headers['Access-Control-Allow-Origin'] = "*"# * means any. specify to
		begin
			thePost = ::Post.find(postId)
			rescue ActiveRecord::RecordNotFound
            render :json => {:status => -1, :message => 'Couldn\'t delete post because post does not exist.' }, :status => 404
			return
		end

		if thePost.user_id == currentUserId # Delete the post
			::Post.delete(params[:id])