app/controllers/api/v1/users/registrations_controller.rb

SELECT COUNT(*) FROM "users" WHERE "users"."email" = $1  [["email", "sidwyn@gmail.com"]]
---
  def create
    response.headers['Access-Control-Allow-Origin'] = "*"# * means any. specify to
    response.headers['Access-Control-Allow-Methods'] = 'POST, PUT, DELETE, GET, OPTIONS'
    response.headers['Access-Control-Request-Method'] = '*'
    response.headers['Access-Control-Allow-Headers'] = 'Origin, X-Requested-With, Content-Type, Accept, Authorization'

    @user = User.where(email: params[:user][:email])
    if !@user.empty?